; domain
(define (domain gold_nugget_story)
(:requirements :typing :conditional-effects :existential-preconditions :equality :universal-preconditions :negative-preconditions :disjunctive-preconditions)
(:types person location 
    nugget nugget2 snake_obj copper_obj - object
)

(:predicates
(connected ?l1 ?l2 - location)
(in ?p - person ?l - location)
(friends ?p1 ?p2 - person)
(tired ?p - person)
(has_object ?l - location ?o - object)
(holds_object ?p - person ?o - object)
(virtuous ?p - person)
(resting ?p - person ?l - location)
(has_snake ?l - location)
(has_nugget ?l - location)
(has_nugget2 ?l - location)
(hidden_snake ?l - location)
(hidden_nugget ?l - location)
(hidden_nugget2 ?l - location)
)

(:action walk
:parameters (?p - person ?l1 ?l2 - location)
:precondition ( and
    (in ?p ?l1) 
    (connected ?l1 ?l2)  
    (not (resting ?p ?l1))
    )
:effect (and
    (forall (?p2 - person)
        (when (and (not (= ?p2 ?p)) (in ?p2 ?l1) (not (resting ?p2 ?l1)) (friends ?p ?p2)) 
        (in ?p2 ?l2)
        )
    
    )
    (in ?p ?l2)
    (when (and (not (virtuous ?p)) (has_snake ?l2)) (not (hidden_snake ?l2)))
    (when (and (virtuous ?p) (has_nugget ?l2)) (not (hidden_nugget ?l2)))
    (when (and (not (hidden_snake ?l1)) (has_snake ?l1)) (hidden_snake ?l1))
    (when (and (not (hidden_nugget ?l1)) (has_nugget ?l1)) (hidden_nugget ?l1))
    (when (and (not (hidden_nugget2 ?l1)) (has_nugget2 ?l1)) (hidden_nugget2 ?l1))

)
)

(:action rest
:parameters (?p - person ?l - location)
:precondition (and
    (in ?p ?l)
    (not (resting ?p ?l))
    (tired ?p)
    (not (exists (?p2 - person) (resting ?p2 ?l) )) 
)
:effect (and 
    (resting ?p ?l)
    (not (tired ?p))
)
)

(:action talk
    :parameters (?p1 - person ?p2 - person)
    :precondition (and 
        (not (= ?p1 ?p2))
        (exists (?l - location) (and (in ?p1 ?l) (in ?p2 ?l)) ) 
    )
    :effect (and 
        (forall (?l - location) (not (resting ?p2 ?l))) 
    )
)

(:action pick_up
    :parameters (?p - person ?o - object ?l - location)
    :precondition (and 
        (in ?p ?l)
        (has_object ?l ?o)
        (or (and (virtuous ?p)  (not (exists (?s - snake_obj) (= ?o ?s))))
            (and (not (virtuous ?p)) 
            (and
                (not (exists (?n - nugget) (= ?n ?o)))
                (not (exists (?n - nugget2) (= ?n ?o)))
            )
            )
        )

    )
    :effect (and 
        (when (exists (?n - nugget) (= ?n ?o)) (not (has_nugget ?l)))
        (when (exists (?n - nugget2) (= ?n ?o)) (not (has_nugget2 ?l)))
        (when (exists (?s - snake_obj) (= ?s ?o)) (not (has_snake ?l)))
        (not (has_object ?l ?o)) 
        (holds_object ?p ?o)
        (not (virtuous ?p))
    )
)

(:action give
    :parameters (?p1 ?p2 - person ?o - object)
    :precondition (and 
        (holds_object ?p1 ?o)
        (exists (?l - location) (and (in ?p1 ?l) (in ?p2 ?l)))
    )
    :effect (and 
        (not (holds_object ?p1 ?o)) 
        (holds_object ?p2 ?o)
        (virtuous ?p1)
    )
)
(:action drop
    :parameters (?p - person ?o - object ?l - location)
    :precondition (and 
        (in ?p ?l)
        (holds_object ?p ?o)
    )
    :effect (and 
        (when (exists (?n - nugget) (= ?n ?o)) (has_nugget ?l))
        (when (exists (?n - nugget2) (= ?n ?o)) (has_nugget2 ?l))
        (when (exists (?s - snake_obj) (= ?s ?o)) (has_snake ?l))
        (not (holds_object ?p ?o) )
        (has_object ?l ?o)
    )
)


)

; problem
(define (problem gold_nugget) (:domain gold_nugget_story)
(:objects
    capital_ki_wu - person
    capital_pao_shu - person
    the_countryman - person
    city - location
    pine_forest - location
    grove - location
    stream - location
    pathway - location
    spring - location
    gold_nugget - nugget
    second_gold_nugget - nugget2
    copper - copper_obj 
    snake - snake_obj
)
(:init
    (friends capital_ki_wu capital_pao_shu)
    (friends capital_pao_shu capital_ki_wu)
    (in capital_ki_wu city)
    (in capital_pao_shu city)
    (virtuous capital_ki_wu)
    (virtuous capital_pao_shu)
    (not (virtuous the_countryman))
    (tired capital_ki_wu)
    (tired capital_pao_shu)
    (has_snake pathway)
    (resting the_countryman spring) 
    (in the_countryman spring)
    (holds_object capital_ki_wu copper)

    (has_object pathway gold_nugget)
    (has_object pathway second_gold_nugget)
    (has_object pathway snake)
    (has_nugget pathway)
    (has_nugget2 pathway)
    (hidden_nugget pathway)
    (hidden_snake pathway)

    (connected city grove)
    (connected grove stream)
    (connected stream pathway)
    (connected pathway spring)
    (connected spring pathway)
    (connected pathway stream)
    (connected stream grove)
    (connected grove city)
)
(:goal (and
    (virtuous capital_ki_wu)
    (virtuous capital_pao_shu)
    (not (resting the_countryman spring))
    (not (tired capital_ki_wu))
    (in capital_ki_wu pathway)
    (in capital_pao_shu pathway)
    (not (tired capital_pao_shu))
    (holds_object capital_ki_wu gold_nugget)
    (holds_object capital_pao_shu second_gold_nugget)
    (not (has_nugget pathway))
    
    
    (not (has_nugget2 pathway))
))
)

; plan
1. (rest capital_ki_wu city)
   deleted: (tired capital_ki_wu)
   added: (resting capital_ki_wu city)
   goals met: 3 of 11
2. (talk capital_pao_shu capital_ki_wu)
   deleted: (resting capital_ki_wu city)
   goals met: 3 of 11
3. (rest capital_pao_shu city)
   deleted: (tired capital_pao_shu)
   added: (resting capital_pao_shu city)
   goals met: 4 of 11
4. (walk capital_ki_wu city grove)
   added: (in capital_ki_wu grove)
   goals met: 4 of 11
5. (walk capital_ki_wu grove stream)
   added: (in capital_ki_wu stream)
   goals met: 4 of 11
6. (walk capital_ki_wu stream pathway)
   deleted: (hidden_nugget pathway)
   added: (in capital_ki_wu pathway)
   goals met: 5 of 11
7. (pick_up capital_ki_wu gold_nugget pathway)
   deleted: (has_nugget pathway) (has_object pathway gold_nugget) (virtuous capital_ki_wu)
   added: (holds_object capital_ki_wu gold_nugget)
   goals met: 6 of 11
8. (give capital_ki_wu capital_pao_shu copper)
   deleted: (holds_object capital_ki_wu copper)
   added: (holds_object capital_pao_shu copper) (virtuous capital_ki_wu)
   goals met: 7 of 11
9. (pick_up capital_ki_wu second_gold_nugget pathway)
   deleted: (has_nugget2 pathway) (has_object pathway second_gold_nugget) (virtuous capital_ki_wu)
   added: (holds_object capital_ki_wu second_gold_nugget)
   goals met: 7 of 11
10. (give capital_ki_wu capital_pao_shu second_gold_nugget)
   deleted: (holds_object capital_ki_wu second_gold_nugget)
   added: (holds_object capital_pao_shu second_gold_nugget) (virtuous capital_ki_wu)
   goals met: 9 of 11
11. (walk capital_ki_wu pathway spring)
   added: (in capital_ki_wu spring)
   goals met: 9 of 11
12. (talk capital_ki_wu the_countryman)
   deleted: (resting the_countryman spring)
   goals met: 10 of 11
13. (talk capital_ki_wu capital_pao_shu)
   deleted: (resting capital_pao_shu city)
   goals met: 10 of 11
14. (walk capital_ki_wu city grove)
   added: (in capital_pao_shu grove)
   goals met: 10 of 11
15. (walk capital_pao_shu grove stream)
   added: (in capital_pao_shu stream)
   goals met: 10 of 11
16. (walk capital_pao_shu stream pathway)
   added: (in capital_pao_shu pathway)
   goals met: 11 of 11
